docker/run.org
#+INCLUDE: ../main.setup
#+TITLE: docker run
#+AUTHOR: Dongsoo Lee
#+EMAIL: dongsoolee8@gmail.com
#+DATE: 2018-02-24

{{{IMAGE_LINK(icon.jpg, docker)}}}

* Overview
  :PROPERTIES: 
  :CUSTOM_ID: overview
  :LANG: en
  :END:      

Run a command in a new container

# ** History
#   :PROPERTIES: 
#   :CUSTOM_ID: history
#   :LANG_EN:  History
#   :LANG_ES:  Historia
#   :LANG_KO:  역사
#   :LANG_ZH:  历史
#   :LANG_JA:  歴史
#   :END:    

# ** Releases
#   :PROPERTIES: 
#   :CUSTOM_ID: releases
#   :LANG_EN:  Releases
#   :LANG_ES:  Lanzamientos
#   :LANG_KO:  릴리즈
#   :LANG_ZH:  发布
#   :LANG_JA:  リリース
#   :END:    

# ** Introduction
#   :PROPERTIES: 
#   :CUSTOM_ID: introduction
#   :LANG_EN:  Introduction
#   :LANG_ES:  Introducción
#   :LANG_KO:  소개
#   :LANG_ZH:  介绍
#   :LANG_JA:  はじめに
#   :END:    

# ** Characteristic
#   :PROPERTIES: 
#   :CUSTOM_ID: characteristic
#   :LANG_EN:  Characteristic
#   :LANG_ES:  Característica
#   :LANG_KO:  특징
#   :LANG_ZH:  特点
#   :LANG_JA:  特徴
#   :END:    

# * How to Install
#   :PROPERTIES: 
#   :CUSTOM_ID: how-to-install
#   :LANG_EN:  How to Install
#   :LANG_ES:  Cómo instalar
#   :LANG_KO:  설치 방법
#   :LANG_ZH:  如何安装
#   :LANG_JA:  インストール方法
#   :END:      

# ** Prerequisites
#    :PROPERTIES: 
#    :CUSTOM_ID: prerequisites
#    :LANG_EN:  Prerequisites
#    :LANG_ES:  Requisitos previos
#    :LANG_KO:  필요 사항
#    :LANG_ZH:  先决条件
#    :LANG_JA:  前準備
#    :END:      

# ** Install
#   :PROPERTIES: 
#   :CUSTOM_ID: install
#   :LANG_EN:  Install
#   :LANG_ES:  Instalar
#   :LANG_KO:  설치
#   :LANG_ZH:  安装
#   :LANG_JA:  インストール
#   :END:      

# ** Installed Packages
#    :PROPERTIES: 
#    :CUSTOM_ID: packages
#    :LANG_EN:  Installed Packages
#    :LANG_ES:  Paquetes instalados
#    :LANG_KO:  설치된 패키지
#    :LANG_ZH:  安装的软件包
#    :LANG_JA:  インストールされたパッケージ
#    :END:      

# ** Check
#    :PROPERTIES: 
#    :CUSTOM_ID: check
#    :LANG_EN:  Check
#    :LANG_ES:  Comprobar
#    :LANG_KO:  확인
#    :LANG_ZH:  检查
#    :LANG_JA:  チェック
#    :END:      

* Usage
  :PROPERTIES: 
  :CUSTOM_ID: usage
  :LANG: en
  :END:      

** Syntax
   :PROPERTIES: 
   :CUSTOM_ID: syntax
   :LANG: en
   :END:      

#+BEGIN_SRC sh
docker run [OPTIONS] IMAGE [COMMAND] [ARG...]
#+END_SRC


# ** Description
#    :PROPERTIES: 
#    :CUSTOM_ID: description
#    :LANG_EN:  Description
#    :LANG_ES:  Descripción
#    :LANG_KO:  설명
#    :LANG_ZH:  详情
#    :LANG_JA:  说明
#    :END:      

** Options
   :PROPERTIES: 
   :CUSTOM_ID: options
   :LANG: en
   :END:      

- --add-host		Add a custom host-to-IP mapping (host:ip)
- --attach , -a		Attach to STDIN, STDOUT or STDERR
- --blkio-weight		Block IO (relative weight), between 10 and 1000, or 0 to disable (default 0)
- --blkio-weight-device		Block IO weight (relative device weight)
- --cap-add		Add Linux capabilities
- --cap-drop		Drop Linux capabilities
- --cgroup-parent		Optional parent cgroup for the container
- --cidfile		Write the container ID to the file
- --cpu-count		CPU count (Windows only)
- --cpu-percent		CPU percent (Windows only)
- --cpu-period		Limit CPU CFS (Completely Fair Scheduler) period
- --cpu-quota		Limit CPU CFS (Completely Fair Scheduler) quota
- --cpu-rt-period		API 1.25+
- Limit CPU real-time period in microseconds
- --cpu-rt-runtime		API 1.25+
- Limit CPU real-time runtime in microseconds
- --cpu-shares , -c		CPU shares (relative weight)
- --cpus		API 1.25+
- Number of CPUs
- --cpuset-cpus		CPUs in which to allow execution (0-3, 0,1)
- --cpuset-mems		MEMs in which to allow execution (0-3, 0,1)
- --detach , -d		Run container in background and print container ID
- --detach-keys		Override the key sequence for detaching a container
- --device		Add a host device to the container
- --device-cgroup-rule		Add a rule to the cgroup allowed devices list
- --device-read-bps		Limit read rate (bytes per second) from a device
- --device-read-iops		Limit read rate (IO per second) from a device
- --device-write-bps		Limit write rate (bytes per second) to a device
- --device-write-iops		Limit write rate (IO per second) to a device
- --disable-content-trust	true	Skip image verification
- --dns		Set custom DNS servers
- --dns-opt		Set DNS options
- --dns-option		Set DNS options
- --dns-search		Set custom DNS search domains
- --entrypoint		Overwrite the default ENTRYPOINT of the image
- --env , -e		Set environment variables
- --env-file		Read in a file of environment variables
- --expose		Expose a port or a range of ports
- --group-add		Add additional groups to join
- --health-cmd		Command to run to check health
- --health-interval		Time between running the check (ms|s|m|h) (default 0s)
- --health-retries		Consecutive failures needed to report unhealthy
- --health-start-period		API 1.29+
- Start period for the container to initialize before starting health-retries countdown (ms|s|m|h) (default 0s)
- --health-timeout		Maximum time to allow one check to run (ms|s|m|h) (default 0s)
- --help		Print usage
- --hostname , -h		Container host name
- --init		API 1.25+
- Run an init inside the container that forwards signals and reaps processes
- --interactive , -i		Keep STDIN open even if not attached
- --io-maxbandwidth		Maximum IO bandwidth limit for the system drive (Windows only)
- --io-maxiops		Maximum IOps limit for the system drive (Windows only)
- --ip		IPv4 address (e.g., 172.30.100.104)
- --ip6		IPv6 address (e.g., 2001:db8::33)
- --ipc		IPC mode to use
- --isolation		Container isolation technology
- --kernel-memory		Kernel memory limit
- --label , -l		Set meta data on a container
- --label-file		Read in a line delimited file of labels
- --link		Add link to another container
- --link-local-ip		Container IPv4/IPv6 link-local addresses
- --log-driver		Logging driver for the container
- --log-opt		Log driver options
- --mac-address		Container MAC address (e.g., 92:d0:c6:0a:29:33)
- --memory , -m		Memory limit
- --memory-reservation		Memory soft limit
- --memory-swap		Swap limit equal to memory plus swap: ‘-1’ to enable unlimited swap
- --memory-swappiness	-1	Tune container memory swappiness (0 to 100)
- --mount		Attach a filesystem mount to the container
- --name		Assign a name to the container
- --net		Connect a container to a network
- --net-alias		Add network-scoped alias for the container
- --network		Connect a container to a network
- --network-alias		Add network-scoped alias for the container
- --no-healthcheck		Disable any container-specified HEALTHCHECK
- --oom-kill-disable		Disable OOM Killer
- --oom-score-adj		Tune host’s OOM preferences (-1000 to 1000)
- --pid		PID namespace to use
- --pids-limit		Tune container pids limit (set -1 for unlimited)
- --platform		experimental (daemon)API 1.32+
- Set platform if server is multi-platform capable
- --privileged		Give extended privileges to this container
- --publish , -p		Publish a container’s port(s) to the host
- --publish-all , -P		Publish all exposed ports to random ports
- --read-only		Mount the container’s root filesystem as read only
- --restart	no	Restart policy to apply when a container exits
- --rm		Automatically remove the container when it exits
- --runtime		Runtime to use for this container
- --security-opt		Security Options
- --shm-size		Size of /dev/shm
- --sig-proxy	true	Proxy received signals to the process
- --stop-signal	SIGTERM	Signal to stop a container
- --stop-timeout		API 1.25+
- Timeout (in seconds) to stop a container
- --storage-opt		Storage driver options for the container
- --sysctl		Sysctl options
- --tmpfs		Mount a tmpfs directory
- --tty , -t		Allocate a pseudo-TTY
- --ulimit		Ulimit options
- --user , -u		Username or UID (format: <name|uid>[:<group|gid>])
- --userns		User namespace to use
- --uts		UTS namespace to use
- --volume , -v		Bind mount a volume
- --volume-driver		Optional volume driver for the container
- --volumes-from		Mount volumes from the specified container(s)
- --workdir , -w		Working directory inside the container

# ** Configuration
#    :PROPERTIES: 
#    :CUSTOM_ID: configuration
#    :LANG_EN:  Configuration
#    :LANG_ES:  Configuración
#    :LANG_KO:  설정
#    :LANG_ZH:  组态
#    :LANG_JA:  設定
#    :END:      

# ** Environment Variables
#    :PROPERTIES: 
#    :CUSTOM_ID: environment-variables
#    :LANG_EN:  Variables
#    :LANG_ES:  Variables de entorno
#    :LANG_KO:  환경 변수
#    :LANG_ZH:  环境变量
#    :LANG_JA:  環境変数
#    :END:      

# ** Commands
#    :PROPERTIES: 
#    :CUSTOM_ID: commands
#    :LANG_EN:  Commands
#    :LANG_ES:  Comandos
#    :LANG_KO:  명령어
#    :LANG_ZH:  命令
#    :LANG_JA:  コマンド
#    :END:      

# ** Examples
#    :PROPERTIES: 
#    :CUSTOM_ID: examples
#    :LANG_EN:  Examples
#    :LANG_ES:  Ejemplos
#    :LANG_KO:  사용 예
#    :LANG_ZH:  例子
#    :LANG_JA:  例
#    :END:      

# * See also
#   :PROPERTIES: 
#   :CUSTOM_ID: seealso
#   :LANG_EN:  See also
#   :LANG_ES:  Ver también
#   :LANG_KO:  관련 항목
#   :LANG_ZH:  相关主题
#   :LANG_JA:  関連項目
#   :END:      

# * References
#   :PROPERTIES: 
#   :CUSTOM_ID: references
#   :LANG_EN:  References
#   :LANG_ES:  Referencias
#   :LANG_KO:  참고자료
#   :LANG_ZH:  参考
#   :LANG_JA:  参考
#   :END:      
