ko/docker/run.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ko" xml:lang="ko">
<head>
<title>docker run</title>
<!-- 2018-02-25 Sun 05:37 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
<meta name="google-site-verification" content="T-NdGYU-tk3BMWg0ULx4wIHD18IFoyrzEEcOoyz4xis" />
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/rtd-full.css"/>
<link rel="stylesheet" type="text/css" href="/dist/org-html-themes/styles/readtheorg/css/emphasis.css"/>
<link rel="stylesheet" type="text/css" href="/dist/assets/css.css"/>
<link href="https://maxcdn.bootstrapcdn.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet" integrity="sha384-wvfXpqpZZVQGK6TAh5PVlGOfQNHSoD2xbE+QkPxCAFlNEevoEH3Sl0sibVcOQVnN" crossorigin="anonymous">
<meta name="title" content="docker run - 리눅스 명령어">
<meta name="description" content="Run a command in a new container ">
<meta name="by" content="Dongsoo Lee">
<meta property="og:type" content="article">
<meta property="og:title" content="docker run - 리눅스 명령어">
<meta property="og:description" content="Run a command in a new container ">
<meta name="twitter:title" content="docker run - 리눅스 명령어">
<meta name="twitter:description" content="Run a command in a new container ">
</head>
<body>
<div id="content">
<h1 class="title">docker run</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#overview">개요</a></li>
<li><a href="#usage">사용법</a>
<ul>
<li><a href="#syntax">구조</a></li>
<li><a href="#options">옵션</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-overview" class="outline-2">
<h2 id="overview"><a id="sec-1" name="sec-1"></a>개요</h2>
<div class="outline-text-2" id="text-overview">

<p>
Run a command in a new container
</p>
</div>
</div>

<div id="outline-container-usage" class="outline-2">
<h2 id="usage"><a id="sec-2" name="sec-2"></a>사용법</h2>
<div class="outline-text-2" id="text-usage">
</div>

<div id="outline-container-syntax" class="outline-3">
<h3 id="syntax"><a id="sec-2-1" name="sec-2-1"></a>구조</h3>
<div class="outline-text-3" id="text-syntax">

<div class="org-src-container">

<pre class="src src-sh">docker run [OPTIONS] IMAGE [COMMAND] [ARG...]
</pre>
</div>
</div>
</div>

<div id="outline-container-options" class="outline-3">
<h3 id="options"><a id="sec-2-2" name="sec-2-2"></a>옵션</h3>
<div class="outline-text-3" id="text-options">

<ul class="org-ul">
<li>--add-host                Add a custom host-to-IP mapping (host:ip)
</li>
<li>--attach , -a                Attach to STDIN, STDOUT or STDERR
</li>
<li>--blkio-weight                Block IO (relative weight), between 10 and 1000, or 0 to disable (default 0)
</li>
<li>--blkio-weight-device                Block IO weight (relative device weight)
</li>
<li>--cap-add                Add Linux capabilities
</li>
<li>--cap-drop                Drop Linux capabilities
</li>
<li>--cgroup-parent                Optional parent cgroup for the container
</li>
<li>--cidfile                Write the container ID to the file
</li>
<li>--cpu-count                CPU count (Windows only)
</li>
<li>--cpu-percent                CPU percent (Windows only)
</li>
<li>--cpu-period                Limit CPU CFS (Completely Fair Scheduler) period
</li>
<li>--cpu-quota                Limit CPU CFS (Completely Fair Scheduler) quota
</li>
<li>--cpu-rt-period                API 1.25+
</li>
<li>Limit CPU real-time period in microseconds
</li>
<li>--cpu-rt-runtime                API 1.25+
</li>
<li>Limit CPU real-time runtime in microseconds
</li>
<li>--cpu-shares , -c                CPU shares (relative weight)
</li>
<li>--cpus                API 1.25+
</li>
<li>Number of CPUs
</li>
<li>--cpuset-cpus                CPUs in which to allow execution (0-3, 0,1)
</li>
<li>--cpuset-mems                MEMs in which to allow execution (0-3, 0,1)
</li>
<li>--detach , -d                Run container in background and print container ID
</li>
<li>--detach-keys                Override the key sequence for detaching a container
</li>
<li>--device                Add a host device to the container
</li>
<li>--device-cgroup-rule                Add a rule to the cgroup allowed devices list
</li>
<li>--device-read-bps                Limit read rate (bytes per second) from a device
</li>
<li>--device-read-iops                Limit read rate (IO per second) from a device
</li>
<li>--device-write-bps                Limit write rate (bytes per second) to a device
</li>
<li>--device-write-iops                Limit write rate (IO per second) to a device
</li>
<li>--disable-content-trust        true        Skip image verification
</li>
<li>--dns                Set custom DNS servers
</li>
<li>--dns-opt                Set DNS options
</li>
<li>--dns-option                Set DNS options
</li>
<li>--dns-search                Set custom DNS search domains
</li>
<li>--entrypoint                Overwrite the default ENTRYPOINT of the image
</li>
<li>--env , -e                Set environment variables
</li>
<li>--env-file                Read in a file of environment variables
</li>
<li>--expose                Expose a port or a range of ports
</li>
<li>--group-add                Add additional groups to join
</li>
<li>--health-cmd                Command to run to check health
</li>
<li>--health-interval                Time between running the check (ms|s|m|h) (default 0s)
</li>
<li>--health-retries                Consecutive failures needed to report unhealthy
</li>
<li>--health-start-period                API 1.29+
</li>
<li>Start period for the container to initialize before starting health-retries countdown (ms|s|m|h) (default 0s)
</li>
<li>--health-timeout                Maximum time to allow one check to run (ms|s|m|h) (default 0s)
</li>
<li>--help                Print usage
</li>
<li>--hostname , -h                Container host name
</li>
<li>--init                API 1.25+
</li>
<li>Run an init inside the container that forwards signals and reaps processes
</li>
<li>--interactive , -i                Keep STDIN open even if not attached
</li>
<li>--io-maxbandwidth                Maximum IO bandwidth limit for the system drive (Windows only)
</li>
<li>--io-maxiops                Maximum IOps limit for the system drive (Windows only)
</li>
<li>--ip                IPv4 address (e.g., 172.30.100.104)
</li>
<li>--ip6                IPv6 address (e.g., 2001:db8::33)
</li>
<li>--ipc                IPC mode to use
</li>
<li>--isolation                Container isolation technology
</li>
<li>--kernel-memory                Kernel memory limit
</li>
<li>--label , -l                Set meta data on a container
</li>
<li>--label-file                Read in a line delimited file of labels
</li>
<li>--link                Add link to another container
</li>
<li>--link-local-ip                Container IPv4/IPv6 link-local addresses
</li>
<li>--log-driver                Logging driver for the container
</li>
<li>--log-opt                Log driver options
</li>
<li>--mac-address                Container MAC address (e.g., 92:d0:c6:0a:29:33)
</li>
<li>--memory , -m                Memory limit
</li>
<li>--memory-reservation                Memory soft limit
</li>
<li>--memory-swap                Swap limit equal to memory plus swap: ‘-1’ to enable unlimited swap
</li>
<li>--memory-swappiness        -1        Tune container memory swappiness (0 to 100)
</li>
<li>--mount                Attach a filesystem mount to the container
</li>
<li>--name                Assign a name to the container
</li>
<li>--net                Connect a container to a network
</li>
<li>--net-alias                Add network-scoped alias for the container
</li>
<li>--network                Connect a container to a network
</li>
<li>--network-alias                Add network-scoped alias for the container
</li>
<li>--no-healthcheck                Disable any container-specified HEALTHCHECK
</li>
<li>--oom-kill-disable                Disable OOM Killer
</li>
<li>--oom-score-adj                Tune host’s OOM preferences (-1000 to 1000)
</li>
<li>--pid                PID namespace to use
</li>
<li>--pids-limit                Tune container pids limit (set -1 for unlimited)
</li>
<li>--platform                experimental (daemon)API 1.32+
</li>
<li>Set platform if server is multi-platform capable
</li>
<li>--privileged                Give extended privileges to this container
</li>
<li>--publish , -p                Publish a container’s port(s) to the host
</li>
<li>--publish-all , -P                Publish all exposed ports to random ports
</li>
<li>--read-only                Mount the container’s root filesystem as read only
</li>
<li>--restart        no        Restart policy to apply when a container exits
</li>
<li>--rm                Automatically remove the container when it exits
</li>
<li>--runtime                Runtime to use for this container
</li>
<li>--security-opt                Security Options
</li>
<li>--shm-size                Size of /dev/shm
</li>
<li>--sig-proxy        true        Proxy received signals to the process
</li>
<li>--stop-signal        SIGTERM        Signal to stop a container
</li>
<li>--stop-timeout                API 1.25+
</li>
<li>Timeout (in seconds) to stop a container
</li>
<li>--storage-opt                Storage driver options for the container
</li>
<li>--sysctl                Sysctl options
</li>
<li>--tmpfs                Mount a tmpfs directory
</li>
<li>--tty , -t                Allocate a pseudo-TTY
</li>
<li>--ulimit                Ulimit options
</li>
<li>--user , -u                Username or UID (format: &lt;name|uid&gt;[:&lt;group|gid&gt;])
</li>
<li>--userns                User namespace to use
</li>
<li>--uts                UTS namespace to use
</li>
<li>--volume , -v                Bind mount a volume
</li>
<li>--volume-driver                Optional volume driver for the container
</li>
<li>--volumes-from                Mount volumes from the specified container(s)
</li>
<li>--workdir , -w                Working directory inside the container
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-02-24</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-02-25 Sun 05:37</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
